backend/performance-test.yml
config:
  target: "https://resplendent-wonder-production-5382.up.railway.app"
  phases:
    - duration: 60
      arrivalRate: 5
  http:
    timeout: 10
scenarios:
  - name: "Smoke test endpoints"
    flow:
      - get:
          url: "/customer"
      - get:
          url: "/invoice"
      - get:
          url: "/quote"
      - get:
          url: "/payment"
      - get:
          url: "/taxes"